/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   my_programm_2.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: USER <EMAIL>                        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: ГГГГ/ММ/ДД ЧЧ:ММ:СС by USER             #+#    #+#             */
/*   Updated: ГГГГ/ММ/ДД ЧЧ:ММ:СС by USER            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>

int	main(void)
{
	printf("Hello, World, this my ferst programm in C language!\n");
	return (0);
}
