/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   my_programm_2.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: USER <EMAIL>                        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: ГГГГ/ММ/ДД ЧЧ:ММ:СС by USER             #+#    #+#             */
/*   Updated: ГГГГ/ММ/ДД ЧЧ:ММ:СС by USER            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>

int	main(void)
{
	int s1 = 49;
	int s2 = 8;
	int s3 = 41;
	int t1 = 6;
	char b1 = '@';
	char b2 = 'O';
	while (s1>0)
	{
		printf("%C",b1);
		s1--;
	}
	printf("\n");
	s1 = 49;
	while (t1>0)
	{
		while (s2>0)
		{
			printf("%C",b2);
			s2--;
		}
		while (s3>0)
		{
			printf("%C",b1);
			s3--;
		}
		printf("\n");
		s2 = 8;
		s3 = 41;
		t1--;
	}
	t1 = 6;
	while (t1>0)
	{
		while(s1>0)
		{
		printf("%C",b1);
		s1--;
		}
		s1 = 49;
		t1--;
		printf("\n");
	}
	return 0;
}
